RU_LEXICON = {
    'start': "Добро пожаловать в магазин гемов RENI Shop\nВоспользуйся меню 👇",
    'free_gems': "💸 Ваш баланс: {} рублей.\nС помощью промокодов и рефереальной системы можно заработать деньги на баланс в боте!\
        \nИспользуйте кнопки ниже 👇",
    'promo': "ℹ️ В боте присутствует система промокодов.\nЕсли вы активируете промокод, то получите за это рубли на баланс!\
        \nЕсли у вас есть промокод, введите его, используя команду /promo.\nПример правильно введенной команды:\n\n<code>/promo TIKEY-97C16DAE1F29</code>",
    'no_promo': '⚠️ Не знаю такого промокода! Проверьте на опечатки!',
    'no_orders': 'У вас нет заказов',
    'games_list': 'Список доступных игр 👇',
    'admin_panel': "<b><i>Админ панель</i></b>",
    'choice_game': '✏️ <i>Выберите игру</i>: ',
    'goods_list': 'Список товаров 👇',
    'your_goods': '🧮 Ваши товары: ',
    'choice_good_for_delete': '🔴 Выберите товар для удаления: ',
    'success_delete': '✅ Товар успешно удален',
    'add_good': "✏️ Введите название и цену товара в формате (каждый с новой строки):\
        \n\n<i>2000 гемов\
        \n5000</i>",
    'success_add_good': "✅ Товар успешно добавлен",
    'your_promos': "🔖 Ваши промокоды: ",
    'add_promo': "✏️ Введите название и номинал промокода в формате (каждый с новой строки):\
        \n\n<i>ADD-50-BONUS\
        \n50</i>",
    'choice_promo_for_delete': '🔴 Выберите промокод для удаления: ',
    'success_add_promo': "✅ Промокод успешно добавлен",
    'success_delete_promo': "✅ Промокод успешно удален",
    'no_active_promo': 'Пока нет ни одного активного промокода 🤷‍♀️',
    'no_available_goods': 'Товаров для этой игры пока нет 🤷‍♀️',
    'referral_link': "🔗 Ваша реферальная ссылка: \n<code>{}</code>\n👥 Количество ваших рефералов: {}\n💸 Процент с каждой покупки реферала: 10%\nℹ️ Ваш баланс увеличивается, когда ваши друзья, воспользовавшиеся вашей реферальной ссылкой, совершают покупки в боте. За этот баланс можно покупать товары в магазине!",
    'success_promo': "🎉 Поздравляем, ваш баланс пополнен на {}₽",
    'no_no_no': '❕ Вы уже использовали этот промокод',
    'balance': """💳 Ваш баланс: {}₽\n\nВы можете пополнить баланс с карты любого банка, либо с Юмани кошелька.\
\n\nЧтобы пополнить баланс, вам нужно:
    1. Нажать кнопку <i>Пополнить баланс</i>'
    2. Ввести сумму пополнения
    3. Перейти на страницу оплаты по ссылке и оплатить счет.
    4. Вернуться в магазин
    5. Нажать кнопку <i>Проверить оплату</i>""",
    'value_add': '✏️ Введите сумму для пополнения(без копеек): ',
    'add_money_details': "💳 Сумма пополнения: {}₽\nСсылка на оплату: {}\n Комментарий к платежу: {}",
    'invalid_input': "⚠️ Введена некорректная сумма для пополнения, повторите ввод: "
}
