RU_LEXICON = {
    'start': "Добро пожаловать в магазин гемов RENI Shop\nВоспользуйся меню 👇",
    'free_gems': "💸 Ваш баланс: {} рублей.\nС помощью промокодов и рефереальной системы можно заработать деньги на баланс в боте!\
        \nИспользуйте кнопки ниже 👇",
    'promo': "ℹ️ В боте присутствует система промокодов.\nЕсли вы активируете промокод, то получите за это рубли на баланс!\
        \nЕсли у вас есть промокод, введите его, используя команду /promo.\nПример правильно введенной команды:\n\n<code>/promo TIKEY-97C16DAE1F29</code>",
    'no_promo': '⚠️ Не знаю такого промокода! Проверьте на опечатки!',
    'no_orders': 'У вас нет заказов',
    'games_list': 'Список доступных игр 👇',
    'admin_panel': "<b><i>Админ панель</i></b>",
    'choice_game': '✏️ <i>Выберите игру</i>: ',
    'goods_list': 'Список товаров 👇',
    'your_goods': '🧮 Ваши товары: ',
    'choice_good_for_delete': '🔴 Выберите товар для удаления: ',
    'success_delete': '✅ Товар успешно удален',
    'add_good': "✏️ Введите название и цену товара в формате (каждый с новой строки):\
        \n\n<i>2000 гемов\
        \n5000</i>",
    'success_add_good': "✅ Товар успешно добавлен",
    'your_promos': "🔖 Ваши промокоды: ",
    'add_promo': "✏️ Введите название и номинал промокода в формате (каждый с новой строки):\
        \n\n<i>ADD-50-BONUS\
        \n50</i>",
    'choice_promo_for_delete': '🔴 Выберите промокод для удаления: ',
    'success_add_promo': "✅ Промокод успешно добавлен",
    'success_delete_promo': "✅ Промокод успешно удален",
    'no_active_promo': 'Пока нет ни одного активного промокода 🤷‍♀️',
    'no_available_goods': 'Товаров для этой игры пока нет 🤷‍♀️',
    'referral_link': "🔗 Ваша реферальная ссылка: \n<code>{}</code>\n👥 Количество ваших рефералов: {}\n💸 Процент с каждой покупки реферала: 10%\nℹ️ Ваш баланс увеличивается, когда ваши друзья, воспользовавшиеся вашей реферальной ссылкой, совершают покупки в боте. За этот баланс можно покупать товары в магазине!",
    'success_promo': "🎉 Поздравляем, ваш баланс пополнен на {}₽",
    'no_no_no': '❕ Вы уже использовали этот промокод',
    'balance': """💳 Ваш баланс: {}₽\n\nВы можете пополнить баланс с карты любого банка, либо с Юмани кошелька.\
        \n\nЧтобы пополнить баланс, вам нужно:
    1. Нажать кнопку <i>Пополнить баланс</i>'
    2. Ввести сумму пополнения
    3. Перейти на страницу оплаты по ссылке и оплатить счет.
    4. Вернуться в магазин
    5. Нажать кнопку <i>Проверить оплату</i>""",
    'value_add': '✏️ Введите сумму для пополнения (без копеек): ',
    'add_money_details': "💳 Сумма пополнения: {}₽\nСсылка на оплату: {}\n Комментарий к платежу: {}",
    'invalid_input': "⚠️ Введена некорректная сумма для пополнения, повторите ввод: ",
    'success_balance': '✅ Баланс успешно пополнен',
    'is_upload': '✅ Фотографии успешно выгружены',
    'no_goods': "🤦‍♀️ Скажите админу добавить товары...",
    'no_photo': "⚠️ Нужно выгрузить фотографии для функционирования бота",
    'good_details': "📦 Ваш товар: \"{}\"\n💳 Цена: {}₽\n\n👇 Для подтверждения заказа пришлите вашу почту в формате:\n<code>example@gmail.com</code>\
        \n\n‼️ Вводите свою настоящую почту от Supercell ID!",
    'invalid_mail': "⚠️ Напишите вашу почту в формате:\n<code>example@mail.com</code>\n\nПожалуйста, пишите реальную почту от Supercell ID!",
    'no_money': "🤷‍♀️ Недостаточно денег на балансе",
    'cancel_order': '❌ Заказ отменен',
    'order_create': '✅ Заказ успешно создан!\n🕔 Скоро я запрошу у вас код для входа в аккаунт!',
    'create_order_push': "{}\n<b>Создан заказ №{}</b>\n\n👤 Заказчик: <code>{}</code>\
        \n✉️ Почта: <code>{}</code>\n\nНаименование: \"{}\"\nЦена: {}₽",
    'get_code': "📬 На вашу почту пришёл код! Отправьте его мне (во вкладке \"Мои заказы\" выберите соответсвующий заказ от {}) в формате:\n<code>123456</code>",
    'send_code': '✏️ Напишите код в формате:\n<code>123456</code>\n\nПожалуйста пишите реальный код, который прислали вам на почту. Без пробелов!',
    'invalid_code': "⚠️ Напишите код в формате:\n<code>123456</code>\nПожалуйста пишите реальный код, который прислали вам на почту. Без пробелов!",
    'valid_code': "✅ Код принял!\nОжидайте, совсем скоро я зайду на аккаунт и выполню заказ!",
    'send_code_push': "<b>Код для заказа №{}</b>\n\n👤 Заказчик: <code>{}</code>\
        \n✉️ Почта: <code>{}</code>\n🔑 Код: <code>{}</code>\n\nНаименование: \"{}\"\nЦена: {}₽",
    'change_mail_push': "<b>Изменение почты для заказа №{}</b>\n\n👤 Заказчик: <code>{}</code>\
        \n✉️ Новая почта: <code>{}</code>\n\nНаименование: \"{}\"\nЦена: {}₽",
    'change_code_push': "<b>Изменение кода для заказа №{}</b>\n\n👤 Заказчик: <code>{}</code>\
        \n✉️ Почта: <code>{}</code>\n🔑 Новый код: <code>{}</code>\n\nНаименование: \"{}\"\nЦена: {}₽",
    'success_order_admin': "\n\n✅ <b>Заказ успешно выполнен</b>",
    'invalid_code_admin': "\n\n❗️ <b>Неверный код</b>",
    'notification_was_sended': "📤 Уведомление отправлено",
    'orders_count': 'Количество ваших заказов: {}',
    'order_details': "Информация о заказе:\n🕒 {}\n📦 {}\n💳 {}₽\nПочта: <code>{}</code>\nКод с почты: <code>{}</code>\nСтатус заказа: {}",
    'edit_mail': "Пришлите новую почту в формате:\n<code>example@mail.ru</code>\n\n‼ Вводите свою настоящую почту от Supercell ID!",
    'edit_code': "Пришлите новый код в формате:\n<code>123456</code>\n\nПожалуйста пишите реальный код, который прислали вам на почту. Без пробелов!",
    'send_invalid_code': "❗️ Присланный вами раннее код для заказа от {} неверный, пожалуйста, измените код (во вкладке \"Мои заказы\" выберите соответсвующий заказ)",
    'success_order': "✅ Заказ от {} успешно выполнен",
    'insert_goods_process': "⚙️ Заполняем БД товарами...",
    'insert_goods_success': "✅ Товары успешно добавлены"
}
